In [2]:
import pandas as pd
import matplotlib as plt
import json
import seaborn as sns

In [3]:
titanic = sns.load_dataset('titanic')

In [10]:
titanic[['age','fare']] + 10

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [12]:
df = titanic.loc[:, ['age', 'fare']]

In [17]:
df['ten'] = 10

In [19]:
df

      age     fare  ten
0    22.0   7.2500   10
1    38.0  71.2833   10
2    26.0   7.9250   10
3    35.0  53.1000   10
4    35.0   8.0500   10
..    ...      ...  ...
886  27.0  13.0000   10
887  19.0  30.0000   10
888   NaN  23.4500   10
889  26.0  30.0000   10
890  32.0   7.7500   10

[891 rows x 3 columns]

In [23]:
def add_10(n):
    return n + 10
add_10(10)

20

In [7]:
def add_two_obj(a,b):
    return a+b
add_two_obj(10,10)

20

In [43]:
sr1 = df.age.apply(add_10)

In [51]:
sr2 = df.age.apply(add_two_obj, b=10)

In [35]:
add_two_obj(df['age'], 10)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [52]:
sr3 = df.age.apply(lambda x: add_10(x))

In [54]:
print(sr1)
print(sr2)
print(sr3)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64
0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64
0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [56]:
df[['age', 'fare']]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [57]:
df[['age', 'fare']].applymap(add_10)

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [58]:
df[['age', 'fare']].apply(add_10)

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [59]:
df['age'].applymap(add_10)

AttributeError: 'Series' object has no attribute 'applymap'

In [60]:
add_10(df[['age','fare']])

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [64]:
df.age.isnull().sum()

177

In [76]:
df.age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [97]:
def missing_value(a):
    return a.isnull()

In [98]:
missing_value(df)

       age   fare    ten
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
886  False  False  False
887  False  False  False
888   True  False  False
889  False  False  False
890  False  False  False

[891 rows x 3 columns]

In [100]:
df.apply(missing_value, axis = 0)

       age   fare    ten
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
886  False  False  False
887  False  False  False
888   True  False  False
889  False  False  False
890  False  False  False

[891 rows x 3 columns]

In [101]:
df.apply(missing_value, axis = 1)

       age   fare    ten
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
886  False  False  False
887  False  False  False
888   True  False  False
889  False  False  False
890  False  False  False

[891 rows x 3 columns]

In [120]:
def min_max(x):
    return x.max(), x.min()

df.apply(min_max, axis=0)

     age      fare  ten
0  80.00  512.3292   10
1   0.42    0.0000   10

In [119]:
def min_max(x):
    return x.max(), x.min()

df.apply(min_max, axis=1)

0         (22.0, 7.25)
1      (71.2833, 10.0)
2        (26.0, 7.925)
3         (53.1, 10.0)
4         (35.0, 8.05)
            ...
886       (27.0, 10.0)
887       (30.0, 10.0)
888      (23.45, 10.0)
889       (30.0, 10.0)
890       (32.0, 7.75)
Length: 891, dtype: object

In [117]:
df[['age', 'fare']].apply(min_max)

age      79.5800
fare    512.3292
dtype: float64

In [135]:
df.loc['total'] = df.apply(lambda x: x.sum())

In [136]:
df

                age          fare          ten         total           avg
0         22.000000      7.250000    10.000000     39.250000     19.625000
1         38.000000     71.283300    10.000000    119.283300     59.641650
2         26.000000      7.925000    10.000000     43.925000     21.962500
3         35.000000     53.100000    10.000000     98.100000     49.050000
4         35.000000      8.050000    10.000000     53.050000     26.525000
...             ...           ...          ...           ...           ...
888             NaN     23.450000    10.000000     33.450000     22.300000
889       26.000000     30.000000    10.000000     66.000000     33.000000
890       32.000000      7.750000    10.000000     49.750000     24.875000
total  21264.485161  28758.285509  8929.977578  58952.748249  30425.051841
avg       59.315161     64.336209    19.977578    143.628949     71.814474

[893 rows x 5 columns]

In [125]:
df.loc['avg'] = df.apply(lambda x: x.mean())

In [126]:
df

                age          fare          ten
0         22.000000      7.250000    10.000000
1         38.000000     71.283300    10.000000
2         26.000000      7.925000    10.000000
3         35.000000     53.100000    10.000000
4         35.000000      8.050000    10.000000
...             ...           ...          ...
888             NaN     23.450000    10.000000
889       26.000000     30.000000    10.000000
890       32.000000      7.750000    10.000000
total  21205.170000  28693.949300  8910.000000
avg       59.315161     64.336209    19.977578

[893 rows x 3 columns]

In [130]:
df['total'] = df.apply(lambda x: x.sum(), axis = 1)

In [131]:
df

             age       fare        ten       total
0      22.000000   7.250000  10.000000   39.250000
1      38.000000  71.283300  10.000000  119.283300
2      26.000000   7.925000  10.000000   43.925000
3      35.000000  53.100000  10.000000   98.100000
4      35.000000   8.050000  10.000000   53.050000
...          ...        ...        ...         ...
888          NaN  23.450000  10.000000   33.450000
889    26.000000  30.000000  10.000000   66.000000
890    32.000000   7.750000  10.000000   49.750000
total        NaN        NaN        NaN    0.000000
avg    59.315161  64.336209  19.977578  143.628949

[893 rows x 4 columns]

In [132]:
df['avg'] = df.apply(lambda x: x.mean(), axis = 1)

In [133]:
df

             age       fare        ten       total        avg
0      22.000000   7.250000  10.000000   39.250000  19.625000
1      38.000000  71.283300  10.000000  119.283300  59.641650
2      26.000000   7.925000  10.000000   43.925000  21.962500
3      35.000000  53.100000  10.000000   98.100000  49.050000
4      35.000000   8.050000  10.000000   53.050000  26.525000
...          ...        ...        ...         ...        ...
888          NaN  23.450000  10.000000   33.450000  22.300000
889    26.000000  30.000000  10.000000   66.000000  33.000000
890    32.000000   7.750000  10.000000   49.750000  24.875000
total        NaN        NaN        NaN    0.000000   0.000000
avg    59.315161  64.336209  19.977578  143.628949  71.814474

[893 rows x 5 columns]

In [137]:
df.drop(['total', 'avg'], axis = 1, inplace=True)

In [140]:
df.drop(['total', 'avg'], axis = 0, inplace=True)

In [144]:
df.loc[['total', 'avg']] = df.apply(lambda x, y: x.sum(), y.mean())

NameError: name 'y' is not defined

In [145]:
def missing_value(a):
    return a.isnull()

In [147]:
missing_value(df)

       age   fare    ten
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
886  False  False  False
887  False  False  False
888   True  False  False
889  False  False  False
890  False  False  False

[891 rows x 3 columns]

In [160]:
def missing_value_count(a):
    return a.isnull().sum()

In [151]:
missing_value_count(df)

age     177
fare      0
ten       0
dtype: int64

In [180]:
def missing_value_count_total(a):
    return a.isnull().sum().sum()

In [153]:
missing_value_count_total(df)

177

In [172]:
def missing_value_count1(a):
    return missing_value(a).sum()

In [173]:
def missing_value_count_total1(a):
    return missing_value_count1(a).sum()

In [163]:
df.pipe(missing_value)

       age   fare    ten
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
886  False  False  False
887  False  False  False
888   True  False  False
889  False  False  False
890  False  False  False

[891 rows x 3 columns]

In [164]:
df.pipe(missing_value_count)

age     177
fare      0
ten       0
dtype: int64

In [165]:
df.pipe(missing_value_count_total)

177

In [175]:
df.pipe(missing_value_count_total1)

177

In [177]:
df.apply(missing_value)

       age   fare    ten
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
886  False  False  False
887  False  False  False
888   True  False  False
889  False  False  False
890  False  False  False

[891 rows x 3 columns]

In [178]:
df.apply(missing_value_count)

age     177
fare      0
ten       0
dtype: int64

In [181]:
df.apply(missing_value_count_total)

age     177
fare      0
ten       0
dtype: int64

In [182]:
df.apply(missing_value_count1)

age     177
fare      0
ten       0
dtype: int64

In [183]:
df.apply(missing_value_count_total1)

age     177
fare      0
ten       0
dtype: int64

In [184]:
type(df.apply(missing_value_count_total1))

pandas.core.series.Series

In [187]:
df.age.apply(min_max)

AttributeError: 'float' object has no attribute 'max'

In [186]:
df.age.pipe(min_max)

(80.0, 0.42)

In [189]:
df.age.isnull().sum()

177

In [192]:
df.isnull().sum()

age     177
fare      0
ten       0
dtype: int64

In [193]:
type(df.isnull().sum().sum())

numpy.int64

In [196]:
f1 = df.applymap(missing_value)
f2 = df.applymap(missing_value_count)
f3 = df.applymap(missing_value_count_total)

print(f1.head(2))
print(f2.head(2))
print(f3.head(2))
print(type(f1))
print(type(f2))
print(type(f3))

# 어플라이 맵은 에러남 
# 어플라이 맵을 쓰는 이유는 작동이 가능한 경우 빨라서 사용

AttributeError: 'float' object has no attribute 'isnull'

In [200]:
f1 = df.pipe(missing_value)
f2 = df.pipe(missing_value_count)


print(f1.head(2))
print(f2.head(2))

print(type(f1))
print(type(f2))

     age   fare    ten
0  False  False  False
1  False  False  False
age     177
fare      0
dtype: int64
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [201]:
f3 = df.pipe(missing_value_count_total)
print(f3)
print(type(f3))

177
<class 'numpy.int64'>

In [202]:
df.age.pipe(min_max)

(80.0, 0.42)

In [203]:
df.pipe(lambda x: x.sum())

age     21205.1700
fare    28693.9493
ten      8910.0000
dtype: float64

In [205]:
df.pipe(lambda x: x.sum(), axis=1) # 파이프의 경우 행으로 계산이 안됨 이럴 떄는 어플라이 활용해야함

TypeError: <lambda>() got an unexpected keyword argument 'axis'

In [206]:
df.apply(lambda x: x.sum(), axis=1)

0       39.2500
1      119.2833
2       43.9250
3       98.1000
4       53.0500
         ...
886     50.0000
887     59.0000
888     33.4500
889     66.0000
890     49.7500
Length: 891, dtype: float64

In [207]:
df.apply(lambda x: x.sum(), axis=0)

age     21205.1700
fare    28693.9493
ten      8910.0000
dtype: float64